-- Сделать репозиторий ФамилияИОFP
-- - коммиты постепенно и последовательно
-- - последним коммитом пушить нельзя

{-
это
многострочный
комментарий
-}

-- это однострочный комментарий

{-
команда для запуска интерактивной среды в терминале:
ghci

загрузка содержимого файла в интерактивную среду (:l ≡ :load):
:l lec02add.hs

перезагрузка текущего файла в среду (:r ≡ :reload):
:r

запрос типа выражения:
:t

выход из интерактивной среды (:q ≡ :quit):
:q
-}

myFun = (\x y z -> x y z)

{-

запросите тип выражения myFun в интерактивной среде:
:t myFun

выполните вычисление со следующими аргументами:
myFun (*) 2 3
сколько у функции myFun аргументов? какие типы у переданных аргументов?

выполните вычисление со следующими аргументами:
myFun (\x -> x) (\y -> y) "Hello world"
сколько у функции myFun аргументов? какие типы у переданных аргументов?

почему работают оба выражения?

запросите тип выражения myFun в интерактивной среде:
:t (myFun (*))
:t (myFun (\x -> x))
:t (myFun (*) 2)
:t (myFun (\x -> x) (\y -> y))

-}

{-

запишите комбинаторы в виде λ-выражений
I = λx. x
ω = λx. x x
Ω = ω ω = (λx. x x)(λx. x x)
K = λx y. x
K∗ = λx y. y
C = λf x y. f y x
B = λf g x. f (g x)
S = λf g x. f x (g x)

запросите типы у интерактивной среды :t ...

передайте такие аргументы, чтобы получить результат в виде значения
передайте такие аргументы, чтобы НЕ получить результат в виде значения (какие ошибки выдает среда, как их исправить?)

-}

-- возьмите выражения из задания по редукции термов и попробуйте довести их до значения в терминале путем добавления аргументов
